Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: واذكر في الكتاب إدريس إنه كان صديقا نبيا
en: Also mention in the Book the case of Idris: He was a man of truth (and sincerity), (and) a prophet:

source: ورفعناه مكانا عليا
en: And We raised him to a lofty station.

source: أولئك الذين أنعم الله عليهم من النبيين من ذرية آدم وممن حملنا مع نوح ومن ذرية إبراهيم وإسرائيل وممن هدينا واجتبينا إذا تتلى عليهم آيات الرحمن خروا سجدا وبكيا
en: Those were some of the prophets on whom Allah did bestow His Grace,- of the posterity of Adam, and of those who We carried (in the Ark) with Noah, and of the posterity of Abraham and Israel of those whom We guided and chose. Whenever the Signs of (Allah) Most Gracious were rehearsed to them, they would fall down in prostrate adoration and in tears.

source: فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا
en: But after them there followed a posterity who missed prayers and followed after lusts soon, then, will they face Destruction,-

source: إلا من تاب وآمن وعمل صالحا فأولئك يدخلون الجنة ولا يظلمون شيئا
en: Except those who repent and believe, and work righteousness: for these will enter the Garden and will not be wronged in the least,-

source: جنات عدن التي وعد الرحمن عباده بالغيب إنه كان وعده مأتيا
en: Gardens of Eternity, those which (Allah) Most Gracious has promised to His servants in the Unseen: for His promise must (necessarily) come to pass.

source: لا يسمعون فيها لغوا إلا سلاما ولهم رزقهم فيها بكرة وعشيا
en: They will not there hear any vain discourse, but only salutations of Peace: And they will have therein their sustenance, morning and evening.

source: تلك الجنة التي نورث من عبادنا من كان تقيا
en: Such is the Garden which We give as an inheritance to those of Our servants who guard against Evil.

source: وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا وما بين ذلك وما كان ربك نسيا
en: (The angels say:) "We descend not but by command of thy Lord: to Him belongeth what is before us and what is behind us, and what is between: and thy Lord never doth forget,-

source: رب السماوات والأرض وما بينهما فاعبده واصطبر لعبادته هل تعلم له سميا
en: "Lord of the heavens and of the earth, and of all that is between them; so worship Him, and be constant and patient in His worship: knowest thou of any who is worthy of the same Name as He?"

source: ويقول الإنسان أإذا ما مت لسوف أخرج حيا
en: Man says: "What! When I am dead, shall I then be raised up alive?"

source: أولا يذكر الإنسان أنا خلقناه من قبل ولم يك شيئا
en: But does not man call to mind that We created him before out of nothing?

source: فوربك لنحشرنهم والشياطين ثم لنحضرنهم حول جهنم جثيا
en: So, by thy Lord, without doubt, We shall gather them together, and (also) the Evil Ones (with them); then shall We bring them forth on their knees round about Hell;

source: ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا
en: Then shall We certainly drag out from every sect all those who were worst in obstinate rebellion against (Allah) Most Gracious.

source: ثم لنحن أعلم بالذين هم أولى بها صليا
en: And certainly We know best those who are most worthy of being burned therein.

source: وإن منكم إلا واردها كان على ربك حتما مقضيا
en: Not one of you but will pass over it: this is, with thy Lord, a Decree which must be accomplished.

source: ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا
en: But We shall save those who guarded against evil, and We shall leave the wrong-doers therein, (humbled) to their knees.

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للذين آمنوا أي الفريقين خير مقاما وأحسن نديا
en: When Our Clear Signs are rehearsed to them, the Unbelievers say to those who believe, "Which of the two sides is best in point of position? Which makes the best show in council?"

source: وكم أهلكنا قبلهم من قرن هم أحسن أثاثا ورئيا
en: But how many (countless) generations before them have we destroyed, who were even better in equipment and in glitter to the eye?

source: قل من كان في الضلالة فليمدد له الرحمن مدا حتى إذا رأوا ما يوعدون إما العذاب وإما الساعة فسيعلمون من هو شر مكانا وأضعف جندا
en: Say: "If any men go astray, (Allah) Most Gracious extends (the rope) to them, until, when they see the warning of Allah (being fulfilled) - either in punishment or in (the approach of) the Hour,- they will at length realise who is worst in position, and (who) weakest in forces!

source: ويزيد الله الذين اهتدوا هدى والباقيات الصالحات خير عند ربك ثوابا وخير مردا
en: "And Allah doth advance in guidance those who seek guidance: and the things that endure, Good Deeds, are best in the sight of thy Lord, as rewards, and best in respect of (their) eventual return."

source: أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا
en: Hast thou then seen the (sort of) man who rejects Our Signs, yet says: "I shall certainly be given wealth and children?"

source: أطلع الغيب أم اتخذ عند الرحمن عهدا
en: Has he penetrated to the Unseen, or has he taken a contract with (Allah) Most Gracious?

source: كلا سنكتب ما يقول ونمد له من العذاب مدا
en: Nay! We shall record what he says, and We shall add and add to his punishment.

source: ونرثه ما يقول ويأتينا فردا
en: To Us shall return all that he talks of and he shall appear before Us bare and alone.

source: واتخذوا من دون الله آلهة ليكونوا لهم عزا
en: And they have taken (for worship) gods other than Allah, to give them power and glory!

source: كلا سيكفرون بعبادتهم ويكونون عليهم ضدا
en: Instead, they shall reject their worship, and become adversaries against them.

source: ألم تر أنا أرسلنا الشياطين على الكافرين تؤزهم أزا
en: Seest thou not that We have set the Evil Ones on against the unbelievers, to incite them with fury?

source: فلا تعجل عليهم إنما نعد لهم عدا
en: So make no haste against them, for We but count out to them a (limited) number (of days).

source: يوم نحشر المتقين إلى الرحمن وفدا
en: The day We shall gather the righteous to (Allah) Most Gracious, like a band presented before a king for honours,

source: ونسوق المجرمين إلى جهنم وردا
en: And We shall drive the sinners to Hell, like thirsty cattle driven down to water,-

source: لا يملكون الشفاعة إلا من اتخذ عند الرحمن عهدا
en: None shall have the power of intercession, but such a one as has received permission (or promise) from (Allah) Most Gracious.

source: وقالوا اتخذ الرحمن ولدا
en: They say: "(Allah) Most Gracious has begotten a son!"

source: لقد جئتم شيئا إدا
en: Indeed ye have put forth a thing most monstrous!

source: تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا
en: At it the skies are ready to burst, the earth to split asunder, and the mountains to fall down in utter ruin,

source: أن دعوا للرحمن ولدا
en: That they should invoke a son for (Allah) Most Gracious.

source: وما ينبغي للرحمن أن يتخذ ولدا
en: For it is not consonant with the majesty of (Allah) Most Gracious that He should beget a son.

source: إن كل من في السماوات والأرض إلا آتي الرحمن عبدا
en: Not one of the beings in the heavens and the earth but must come to (Allah) Most Gracious as a servant.

source: لقد أحصاهم وعدهم عدا
en: He does take an account of them (all), and hath numbered them (all) exactly.

source: وكلهم آتيه يوم القيامة فردا
en: And everyone of them will come to Him singly on the Day of Judgment.

source: إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا
en: On those who believe and work deeds of righteousness, will (Allah) Most Gracious bestow love.

source: فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا
en: So have We made the (Qur'an) easy in thine own tongue, that with it thou mayest give Glad Tidings to the righteous, and warnings to people given to contention.

source: وكم أهلكنا قبلهم من قرن هل تحس منهم من أحد أو تسمع لهم ركزا
en: But how many (countless) generations before them have We destroyed? Canst thou find a single one of them (now) or hear (so much as) a whisper of them?

source: طه
en: Ta-Ha.

source: ما أنزلنا عليك القرآن لتشقى
en: We have not sent down the Qur'an to thee to be (an occasion) for thy distress,

source: إلا تذكرة لمن يخشى
en: But only as an admonition to those who fear (Allah),-

source: تنزيلا ممن خلق الأرض والسماوات العلى
en: A revelation from Him Who created the earth and the heavens on high.

source: الرحمن على العرش استوى
en: (Allah) Most Gracious is firmly established on the throne (of authority).

source: له ما في السماوات وما في الأرض وما بينهما وما تحت الثرى
en: To Him belongs what is in the heavens and on earth, and all between them, and all beneath the soil.

source: وإن تجهر بالقول فإنه يعلم السر وأخفى
en: If thou pronounce the word aloud, (it is no matter): for verily He knoweth what is secret and what is yet more hidden.

source: الله لا إله إلا هو له الأسماء الحسنى
en: Allah! there is no god but He! To Him belong the most Beautiful Names.

source: وهل أتاك حديث موسى
en: Has the story of Moses reached thee?

source: إذ رأى نارا فقال لأهله امكثوا إني آنست نارا لعلي آتيكم منها بقبس أو أجد على النار هدى
en: Behold, he saw a fire: So he said to his family, "Tarry ye; I perceive a fire; perhaps I can bring you some burning brand therefrom, or find some guidance at the fire."

source: فلما أتاها نودي يا موسى
en: But when he came to the fire, a voice was heard: "O Moses!

source: إني أنا ربك فاخلع نعليك إنك بالواد المقدس طوى
en: "Verily I am thy Lord! therefore (in My presence) put off thy shoes: thou art in the sacred valley Tuwa.

source: وأنا اخترتك فاستمع لما يوحى
en: "I have chosen thee: listen, then, to the inspiration (sent to thee).

source: إنني أنا الله لا إله إلا أنا فاعبدني وأقم الصلاة لذكري
en: "Verily, I am Allah: There is no god but I: So serve thou Me (only), and establish regular prayer for celebrating My praise.

source: إن الساعة آتية أكاد أخفيها لتجزى كل نفس بما تسعى
en: "Verily the Hour is coming - My design is to keep it hidden - for every soul to receive its reward by the measure of its Endeavour.

source: فلا يصدنك عنها من لا يؤمن بها واتبع هواه فتردى
en: "Therefore let not such as believe not therein but follow their own lusts, divert thee therefrom, lest thou perish!"..

source: وما تلك بيمينك يا موسى
en: "And what is that in the right hand, O Moses?"

source: قال هي عصاي أتوكأ عليها وأهش بها على غنمي ولي فيها مآرب أخرى
en: He said, "It is my rod: on it I lean; with it I beat down fodder for my flocks; and in it I find other uses."

source: قال ألقها يا موسى
en: (Allah) said, "Throw it, O Moses!"

source: فألقاها فإذا هي حية تسعى
en: He threw it, and behold! It was a snake, active in motion.

source: قال خذها ولا تخف سنعيدها سيرتها الأولى
en: (Allah) said, "Seize it, and fear not: We shall return it at once to its former condition"..

source: واضمم يدك إلى جناحك تخرج بيضاء من غير سوء آية أخرى
en: "Now draw thy hand close to thy side: It shall come forth white (and shining), without harm (or stain),- as another Sign,-

source: لنريك من آياتنا الكبرى
en: "In order that We may show thee (two) of our Greater Signs.

source: اذهب إلى فرعون إنه طغى
en: "Go thou to Pharaoh, for he has indeed transgressed all bounds."

source: قال رب اشرح لي صدري
en: (Moses) said: "O my Lord! expand me my breast;

source: ويسر لي أمري
en: "Ease my task for me;

source: واحلل عقدة من لساني
en: "And remove the impediment from my speech,

source: يفقهوا قولي
en: "So they may understand what I say:

source: واجعل لي وزيرا من أهلي
en: "And give me a Minister from my family,

source: هارون أخي
en: "Aaron, my brother;

source: اشدد به أزري
en: "Add to my strength through him,

source: وأشركه في أمري
en: "And make him share my task:

source: كي نسبحك كثيرا
en: "That we may celebrate Thy praise without stint,

source: ونذكرك كثيرا
en: "And remember Thee without stint:

source: إنك كنت بنا بصيرا
en: "For Thou art He that (ever) regardeth us."

source: قال قد أوتيت سؤلك يا موسى
en: (Allah) said: "Granted is thy prayer, O Moses!"

source: ولقد مننا عليك مرة أخرى
en: "And indeed We conferred a favour on thee another time (before).

source: إذ أوحينا إلى أمك ما يوحى
en: "Behold! We sent to thy mother, by inspiration, the message:

source: أن اقذفيه في التابوت فاقذفيه في اليم فليلقه اليم بالساحل يأخذه عدو لي وعدو له وألقيت عليك محبة مني ولتصنع على عيني
en: "'Throw (the child) into the chest, and throw (the chest) into the river: the river will cast him up on the bank, and he will be taken up by one who is an enemy to Me and an enemy to him': But I cast (the garment of) love over thee from Me: and (this) in order that thou mayest be reared under Mine eye.

source: إذ تمشي أختك فتقول هل أدلكم على من يكفله فرجعناك إلى أمك كي تقر عينها ولا تحزن وقتلت نفسا فنجيناك من الغم وفتناك فتونا فلبثت سنين في أهل مدين ثم جئت على قدر يا موسى
en: "Behold! thy sister goeth forth and saith, 'shall I show you one who will nurse and rear the (child)?' So We brought thee back to thy mother, that her eye might be cooled and she should not grieve. Then thou didst slay a man, but We saved thee from trouble, and We tried thee in various ways. Then didst thou tarry a number of years with the people of Midian. Then didst thou come hither as ordained, O Moses!

source: واصطنعتك لنفسي
en: "And I have prepared thee for Myself (for service)"..

source: اذهب أنت وأخوك بآياتي ولا تنيا في ذكري
en: "Go, thou and thy brother, with My Signs, and slacken not, either of you, in keeping Me in remembrance.

source: اذهبا إلى فرعون إنه طغى
en: "Go, both of you, to Pharaoh, for he has indeed transgressed all bounds;

source: فقولا له قولا لينا لعله يتذكر أو يخشى
en: "But speak to him mildly; perchance he may take warning or fear (Allah)."

source: قالا ربنا إننا نخاف أن يفرط علينا أو أن يطغى
en: They (Moses and Aaron) said: "Our Lord! We fear lest he hasten with insolence against us, or lest he transgress all bounds."

source: قال لا تخافا إنني معكما أسمع وأرى
en: He said: "Fear not: for I am with you: I hear and see (everything).

source: فأتياه فقولا إنا رسولا ربك فأرسل معنا بني إسرائيل ولا تعذبهم قد جئناك بآية من ربك والسلام على من اتبع الهدى
en: "So go ye both to him, and say, 'Verily we are messengers sent by thy Lord: Send forth, therefore, the Children of Israel with us, and afflict them not: with a Sign, indeed, have we come from thy Lord! and peace to all who follow guidance!

source: إنا قد أوحي إلينا أن العذاب على من كذب وتولى
en: "'Verily it has been revealed to us that the Penalty (awaits) those who reject and turn away.'"

source: قال فمن ربكما يا موسى
en: (When this message was delivered), (Pharaoh) said: "Who, then, O Moses, is the Lord of you two?"

source: قال ربنا الذي أعطى كل شيء خلقه ثم هدى
en: He said: "Our Lord is He Who gave to each (created) thing its form and nature, and further, gave (it) guidance."

source: قال فما بال القرون الأولى
en: (Pharaoh) said: "What then is the condition of previous generations?"

source: قال علمها عند ربي في كتاب لا يضل ربي ولا ينسى
en: He replied: "The knowledge of that is with my Lord, duly recorded: my Lord never errs, nor forgets,-

source: الذي جعل لكم الأرض مهدا وسلك لكم فيها سبلا وأنزل من السماء ماء فأخرجنا به أزواجا من نبات شتى
en: "He Who has, made for you the earth like a carpet spread out; has enabled you to go about therein by roads (and channels); and has sent down water from the sky." With it have We produced diverse pairs of plants each separate from the others.

source: كلوا وارعوا أنعامكم إن في ذلك لآيات لأولي النهى
en: Eat (for yourselves) and pasture your cattle: verily, in this are Signs for men endued with understanding.

source: منها خلقناكم وفيها نعيدكم ومنها نخرجكم تارة أخرى
en: From the (earth) did We create you, and into it shall We return you, and from it shall We bring you out once again.

source: ولقد أريناه آياتنا كلها فكذب وأبى
en: And We showed Pharaoh all Our Signs, but he did reject and refuse.

source: قال أجئتنا لتخرجنا من أرضنا بسحرك يا موسى
en: He said: "Hast thou come to drive us out of our land with thy magic, O Moses?

source: فلنأتينك بسحر مثله فاجعل بيننا وبينك موعدا لا نخلفه نحن ولا أنت مكانا سوى
en: "But we can surely produce magic to match thine! So make a tryst between us and thee, which we shall not fail to keep - neither we nor thou - in a place where both shall have even chances."

source: قال موعدكم يوم الزينة وأن يحشر الناس ضحى
en: Moses said: "Your tryst is the Day of the Festival, and let the people be assembled when the sun is well up."

source: فتولى فرعون فجمع كيده ثم أتى
en: So Pharaoh withdrew: He concerted his plan, and then came (back).

source: قال لهم موسى ويلكم لا تفتروا على الله كذبا فيسحتكم بعذاب وقد خاب من افترى
en: Moses said to him: Woe to you! Forge not ye a lie against Allah, lest He destroy you (at once) utterly by chastisement: the forger must suffer frustration!"

source: فتنازعوا أمرهم بينهم وأسروا النجوى
en: So they disputed, one with another, over their affair, but they kept their talk secret.

source: قالوا إن هذان لساحران يريدان أن يخرجاكم من أرضكم بسحرهما ويذهبا بطريقتكم المثلى
en: They said: "These two are certainly (expert) magicians: their object is to drive you out from your land with their magic, and to do away with your most cherished institutions.

source: فأجمعوا كيدكم ثم ائتوا صفا وقد أفلح اليوم من استعلى
en: "Therefore concert your plan, and then assemble in (serried) ranks: He wins (all along) today who gains the upper hand."

source: قالوا يا موسى إما أن تلقي وإما أن نكون أول من ألقى
en: They said: "O Moses! whether wilt thou that thou throw (first) or that we be the first to throw?"

source: قال بل ألقوا فإذا حبالهم وعصيهم يخيل إليه من سحرهم أنها تسعى
en: He said, "Nay, throw ye first!" Then behold their ropes and their rods-so it seemed to him on account of their magic - began to be in lively motion!

source: فأوجس في نفسه خيفة موسى
en: So Moses conceived in his mind a (sort of) fear.

source: قلنا لا تخف إنك أنت الأعلى
en: We said: "Fear not! for thou hast indeed the upper hand:

source: وألق ما في يمينك تلقف ما صنعوا إنما صنعوا كيد ساحر ولا يفلح الساحر حيث أتى
en: "Throw that which is in thy right hand: Quickly will it swallow up that which they have faked what they have faked is but a magician's trick: and the magician thrives not, (no matter) where he goes."

source: فألقي السحرة سجدا قالوا آمنا برب هارون وموسى
en: So the magicians were thrown down to prostration: they said, "We believe in the Lord of Aaron and Moses".

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم في جذوع النخل ولتعلمن أينا أشد عذابا وأبقى
en: (Pharaoh) said: "Believe ye in Him before I give you permission? Surely this must be your leader, who has taught you magic! be sure I will cut off your hands and feet on opposite sides, and I will have you crucified on trunks of palm-trees: so shall ye know for certain, which of us can give the more severe and the more lasting punishment!"

source: قالوا لن نؤثرك على ما جاءنا من البينات والذي فطرنا فاقض ما أنت قاض إنما تقضي هذه الحياة الدنيا
en: They said: "Never shall we regard thee as more than the Clear Signs that have come to us, or than Him Who created us! so decree whatever thou desirest to decree: for thou canst only decree (touching) the life of this world.

source: إنا آمنا بربنا ليغفر لنا خطايانا وما أكرهتنا عليه من السحر والله خير وأبقى
en: "For us, we have believed in our Lord: may He forgive us our faults, and the magic to which thou didst compel us: for Allah is Best and Most Abiding."

source: إنه من يأت ربه مجرما فإن له جهنم لا يموت فيها ولا يحيى
en: Verily he who comes to his Lord as a sinner (at Judgment),- for him is Hell: therein shall he neither die nor live.

source: ومن يأته مؤمنا قد عمل الصالحات فأولئك لهم الدرجات العلى
en: But such as come to Him as Believers who have worked righteous deeds,- for them are ranks exalted,-

source: جنات عدن تجري من تحتها الأنهار خالدين فيها وذلك جزاء من تزكى
en: Gardens of Eternity, beneath which flow rivers: they will dwell therein for aye: such is the reward of those who purify themselves (from evil).

source: ولقد أوحينا إلى موسى أن أسر بعبادي فاضرب لهم طريقا في البحر يبسا لا تخاف دركا ولا تخشى
en: We sent an inspiration to Moses: "Travel by night with My servants, and strike a dry path for them through the sea, without fear of being overtaken (by Pharaoh) and without (any other) fear."

source: فأتبعهم فرعون بجنوده فغشيهم من اليم ما غشيهم
en: Then Pharaoh pursued them with his forces, but the waters completely overwhelmed them and covered them up.

source: وأضل فرعون قومه وما هدى
en: Pharaoh led his people astray instead of leading them aright.

source: يا بني إسرائيل قد أنجيناكم من عدوكم وواعدناكم جانب الطور الأيمن ونزلنا عليكم المن والسلوى
en: O ye Children of Israel! We delivered you from your enemy, and We made a Covenant with you on the right side of Mount (Sinai), and We sent down to you Manna and quails:

source: كلوا من طيبات ما رزقناكم ولا تطغوا فيه فيحل عليكم غضبي ومن يحلل عليه غضبي فقد هوى
en: (Saying): "Eat of the good things We have provided for your sustenance, but commit no excess therein, lest My Wrath should justly descend on you: and those on whom descends My Wrath do perish indeed!

source: وإني لغفار لمن تاب وآمن وعمل صالحا ثم اهتدى
en: "But, without doubt, I am (also) He that forgives again and again, to those who repent, believe, and do right, who,- in fine, are ready to receive true guidance."

source: وما أعجلك عن قومك يا موسى
en: (When Moses was up on the Mount, Allah said:) "What made thee hasten in advance of thy people, O Moses?"

source: قال هم أولاء على أثري وعجلت إليك رب لترضى
en: He replied: "Behold, they are close on my footsteps: I hastened to thee, O my Lord, to please thee."

source: قال فإنا قد فتنا قومك من بعدك وأضلهم السامري
en: (Allah) said: "We have tested thy people in thy absence: the Samiri has led them astray."

source: فرجع موسى إلى قومه غضبان أسفا قال يا قوم ألم يعدكم ربكم وعدا حسنا أفطال عليكم العهد أم أردتم أن يحل عليكم غضب من ربكم فأخلفتم موعدي
en: So Moses returned to his people in a state of indignation and sorrow. He said: "O my people! did not your Lord make a handsome promise to you? Did then the promise seem to you long (in coming)? Or did ye desire that Wrath should descend from your Lord on you, and so ye broke your promise to me?"

source: قالوا ما أخلفنا موعدك بملكنا ولكنا حملنا أوزارا من زينة القوم فقذفناها فكذلك ألقى السامري
en: They said: "We broke not the promise to thee, as far as lay in our power: but we were made to carry the weight of the ornaments of the (whole) people, and we threw them (into the fire), and that was what the Samiri suggested.

source: فأخرج لهم عجلا جسدا له خوار فقالوا هذا إلهكم وإله موسى فنسي
en: "Then he brought out (of the fire) before the (people) the image of a calf: It seemed to low: so they said: This is your god, and the god of Moses, but (Moses) has forgotten!"

source: أفلا يرون ألا يرجع إليهم قولا ولا يملك لهم ضرا ولا نفعا
en: Could they not see that it could not return them a word (for answer), and that it had no power either to harm them or to do them good?

source: ولقد قال لهم هارون من قبل يا قوم إنما فتنتم به وإن ربكم الرحمن فاتبعوني وأطيعوا أمري
en: Aaron had already, before this said to them: "O my people! ye are being tested in this: for verily your Lord is (Allah) Most Gracious; so follow me and obey my command."

source: قالوا لن نبرح عليه عاكفين حتى يرجع إلينا موسى
en: They had said: "We will not abandon this cult, but we will devote ourselves to it until Moses returns to us."

source: قال يا هارون ما منعك إذ رأيتهم ضلوا
en: (Moses) said: "O Aaron! what kept thee back, when thou sawest them going wrong,

source: ألا تتبعن أفعصيت أمري
en: "From following me? Didst thou then disobey my order?"

source: قال يا ابن أم لا تأخذ بلحيتي ولا برأسي إني خشيت أن تقول فرقت بين بني إسرائيل ولم ترقب قولي
en: (Aaron) replied: "O son of my mother! Seize (me) not by my beard nor by (the hair of) my head! Truly I feared lest thou shouldst say, 'Thou has caused a division among the children of Israel, and thou didst not respect my word!'"

source: قال فما خطبك يا سامري
en: (Moses) said: "What then is thy case, O Samiri?"
